
#pragma pack(push,1)
	class CCFish
	{
	public:
		unsigned char _0x0[0x140];
		int    	m_nModelIndex; // 0x140
		unsigned char _0x144[0x3];
		int    	m_lifeState; // 0x147
		unsigned char _0x14b[0x855];
		float  	m_x; // 0x9a0
		float  	m_y; // 0x9a4
		float  	m_z; // 0x9a8
		unsigned char _0x9ac[0x4];
		float  	m_angle; // 0x9b0
		unsigned char _0x9b4[0x4];
		vector3	m_poolOrigin; // 0x9b8
		float  	m_waterLevel; // 0x9c4
	};
#pragma pack(pop)
