
#pragma pack(push,1)
	class CMusic
	{
	public:
		unsigned char _0x0[0x8];
		float  	nv_m_CIDamageDuck; // 0x8
		float  	nv_m_CIDamageMob; // 0xc
		unsigned char _0x10[0x4];
		float  	nv_m_zombatMusic; // 0x14
		float  	nv_m_zombatMusic2; // 0x18
		float  	nv_m_zombatMusic3; // 0x1c
		unsigned char _0x20[0x4];
		float  	nv_m_witchRage; // 0x24
		float  	nv_m_ambientVolume; // 0x28
		unsigned char _0x2c[0x4];
		float  	m_fNVAdrenaline; // 0x30
		unsigned char _0x34[0x4];
		int    	nv_m_inCheckpoint; // 0x38
	};
#pragma pack(pop)
