
#pragma pack(push,1)
	class CSpriteTrail
	{
	public:
		unsigned char _0x0[0xccc];
		float  	m_flLifeTime; // 0xccc
		float  	m_flStartWidth; // 0xcd0
		float  	m_flEndWidth; // 0xcd4
		float  	m_flStartWidthVariance; // 0xcd8
		float  	m_flTextureRes; // 0xcdc
		float  	m_flMinFadeLength; // 0xce0
		vector3	m_vecSkyboxOrigin; // 0xce4
		float  	m_flSkyboxScale; // 0xcf0
	};
#pragma pack(pop)
