
#pragma pack(push,1)
	class CTEBullets
	{
	public:
		unsigned char _0x0[0x10];
		int    	m_iPlayer; // 0x10
		vector3	m_vecOrigin; // 0x14
		float  	m_vecAngles_0; // 0x20
		float  	m_vecAngles_1; // 0x24
		unsigned char _0x28[0x4];
		int    	m_iWeaponID; // 0x2c
		int    	m_iMode; // 0x30
		int    	m_iSeed; // 0x34
		float  	m_flSoundTime; // 0x38
	};
#pragma pack(pop)
